#### Loading the dependencies

In [2]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

#### Loading the dataset

In [3]:
data = pd.read_csv('./titanic.csv')
data.head()

FileNotFoundError: [Errno 2] No such file or directory: './titanic.csv'

### droping the columns

In [ ]:
data.columns

In [6]:
data.drop(columns=['PassengerId', 'Name', 'Ticket', 'Cabin'], inplace= True)

In [7]:
data.head(10)

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S
5         0       3    male   NaN      0      0   8.4583        Q
6         0       1    male  54.0      0      0  51.8625        S
7         0       3    male   2.0      3      1  21.0750        S
8         1       3  female  27.0      0      2  11.1333        S
9         1       2  female  14.0      1      0  30.0708        C

#### groupby

#### Gender wise average age

In [4]:
data.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [15]:
data.groupby(['Sex'])['Age'].mean().reset_index()

      Sex        Age
0  female  27.915709
1    male  30.726645

In [17]:
data.groupby(['Pclass'])['Age'].mean().reset_index()

   Pclass        Age
0       1  38.233441
1       2  29.877630
2       3  25.140620

In [19]:
data.groupby(['Embarked'])['Age'].mean().reset_index()

  Embarked        Age
0        C  30.814769
1        Q  28.089286
2        S  29.445397

In [21]:
data.groupby(['Pclass'])['Fare'].sum().reset_index()

   Pclass        Fare
0       1  18177.4125
1       2   3801.8417
2       3   6714.6951

In [23]:
Genderwise_Avg_Age = data.groupby(['Sex'])['Age'].mean()
Genderwise_Avg_Age

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [25]:
data.groupby(['Pclass'])['Age'].mean()

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

In [27]:
data.groupby(['Embarked'])['Age'].mean()

Embarked
C    30.814769
Q    28.089286
S    29.445397
Name: Age, dtype: float64

In [29]:
data.groupby(['Sex'])['Survived'].sum()

Sex
female    233
male      109
Name: Survived, dtype: int64

In [31]:
Sex_Survived_Sum = data.groupby(['Sex'])['Survived'].sum().reset_index()

In [33]:
Sex_Survived_Sum

      Sex  Survived
0  female       233
1    male       109

In [35]:
Sex_Survived_Average = data.groupby(['Sex'])['Survived'].mean()*100

In [37]:
Sex_Survived_Average

Sex
female    74.203822
male      18.890815
Name: Survived, dtype: float64

In [39]:
data.groupby(['Embarked'])['Survived'].sum().reset_index()

  Embarked  Survived
0        C        93
1        Q        30
2        S       217

In [41]:
data.groupby(['Embarked'])['Fare'].sum().reset_index()

  Embarked        Fare
0        C  10072.2962
1        Q   1022.2543
2        S  17439.3988

In [42]:
data.groupby(['Pclass'])['Fare'].sum().reset_index()

   Pclass        Fare
0       1  18177.4125
1       2   3801.8417
2       3   6714.6951

In [45]:
data.groupby(['Pclass', 'Embarked'])['Fare'].sum().reset_index()

   Pclass Embarked       Fare
0       1        C  8901.0750
1       1        Q   180.0000
2       1        S  8936.3375
3       2        C   431.0917
4       2        Q    37.0500
5       2        S  3333.7000
6       3        C   740.1295
7       3        Q   805.2043
8       3        S  5169.3613

In [46]:
data.groupby(['Embarked', 'Pclass'])['Fare'].sum().reset_index()

  Embarked  Pclass       Fare
0        C       1  8901.0750
1        C       2   431.0917
2        C       3   740.1295
3        Q       1   180.0000
4        Q       2    37.0500
5        Q       3   805.2043
6        S       1  8936.3375
7        S       2  3333.7000
8        S       3  5169.3613

#### Querying the data

In [48]:
data[data['Sex'] == 'male']

     Survived  Pclass   Sex   Age  SibSp  Parch     Fare Embarked
0           0       3  male  22.0      1      0   7.2500        S
4           0       3  male  35.0      0      0   8.0500        S
5           0       3  male   NaN      0      0   8.4583        Q
6           0       1  male  54.0      0      0  51.8625        S
7           0       3  male   2.0      3      1  21.0750        S
..        ...     ...   ...   ...    ...    ...      ...      ...
883         0       2  male  28.0      0      0  10.5000        S
884         0       3  male  25.0      0      0   7.0500        S
886         0       2  male  27.0      0      0  13.0000        S
889         1       1  male  26.0      0      0  30.0000        C
890         0       3  male  32.0      0      0   7.7500        Q

[577 rows x 8 columns]

In [51]:
data.query("Sex == 'male'")

     Survived  Pclass   Sex   Age  SibSp  Parch     Fare Embarked
0           0       3  male  22.0      1      0   7.2500        S
4           0       3  male  35.0      0      0   8.0500        S
5           0       3  male   NaN      0      0   8.4583        Q
6           0       1  male  54.0      0      0  51.8625        S
7           0       3  male   2.0      3      1  21.0750        S
..        ...     ...   ...   ...    ...    ...      ...      ...
883         0       2  male  28.0      0      0  10.5000        S
884         0       3  male  25.0      0      0   7.0500        S
886         0       2  male  27.0      0      0  13.0000        S
889         1       1  male  26.0      0      0  30.0000        C
890         0       3  male  32.0      0      0   7.7500        Q

[577 rows x 8 columns]

In [54]:
data.query("Sex == 'female'")

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
1           1       1  female  38.0      1      0  71.2833        C
2           1       3  female  26.0      0      0   7.9250        S
3           1       1  female  35.0      1      0  53.1000        S
8           1       3  female  27.0      0      2  11.1333        S
9           1       2  female  14.0      1      0  30.0708        C
..        ...     ...     ...   ...    ...    ...      ...      ...
880         1       2  female  25.0      0      1  26.0000        S
882         0       3  female  22.0      0      0  10.5167        S
885         0       3  female  39.0      0      5  29.1250        Q
887         1       1  female  19.0      0      0  30.0000        S
888         0       3  female   NaN      1      2  23.4500        S

[314 rows x 8 columns]

In [56]:
data.query("Survived == 1")

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
1           1       1  female  38.0      1      0  71.2833        C
2           1       3  female  26.0      0      0   7.9250        S
3           1       1  female  35.0      1      0  53.1000        S
8           1       3  female  27.0      0      2  11.1333        S
9           1       2  female  14.0      1      0  30.0708        C
..        ...     ...     ...   ...    ...    ...      ...      ...
875         1       3  female  15.0      0      0   7.2250        C
879         1       1  female  56.0      0      1  83.1583        C
880         1       2  female  25.0      0      1  26.0000        S
887         1       1  female  19.0      0      0  30.0000        S
889         1       1    male  26.0      0      0  30.0000        C

[342 rows x 8 columns]

In [58]:
data.query("Embarked == 'Q'")

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
5           0       3    male   NaN      0      0   8.4583        Q
16          0       3    male   2.0      4      1  29.1250        Q
22          1       3  female  15.0      0      0   8.0292        Q
28          1       3  female   NaN      0      0   7.8792        Q
32          1       3  female   NaN      0      0   7.7500        Q
..        ...     ...     ...   ...    ...    ...      ...      ...
790         0       3    male   NaN      0      0   7.7500        Q
825         0       3    male   NaN      0      0   6.9500        Q
828         1       3    male   NaN      0      0   7.7500        Q
885         0       3  female  39.0      0      5  29.1250        Q
890         0       3    male  32.0      0      0   7.7500        Q

[77 rows x 8 columns]

In [60]:
data.query("Sex == 'male' & Embarked == 'S'")

     Survived  Pclass   Sex   Age  SibSp  Parch     Fare Embarked
0           0       3  male  22.0      1      0   7.2500        S
4           0       3  male  35.0      0      0   8.0500        S
6           0       1  male  54.0      0      0  51.8625        S
7           0       3  male   2.0      3      1  21.0750        S
12          0       3  male  20.0      0      0   8.0500        S
..        ...     ...   ...   ...    ...    ...      ...      ...
878         0       3  male   NaN      0      0   7.8958        S
881         0       3  male  33.0      0      0   7.8958        S
883         0       2  male  28.0      0      0  10.5000        S
884         0       3  male  25.0      0      0   7.0500        S
886         0       2  male  27.0      0      0  13.0000        S

[441 rows x 8 columns]

In [62]:
data.query("Survived == 1 & Sex == 'female'")

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
1           1       1  female  38.0      1      0  71.2833        C
2           1       3  female  26.0      0      0   7.9250        S
3           1       1  female  35.0      1      0  53.1000        S
8           1       3  female  27.0      0      2  11.1333        S
9           1       2  female  14.0      1      0  30.0708        C
..        ...     ...     ...   ...    ...    ...      ...      ...
874         1       2  female  28.0      1      0  24.0000        C
875         1       3  female  15.0      0      0   7.2250        C
879         1       1  female  56.0      0      1  83.1583        C
880         1       2  female  25.0      0      1  26.0000        S
887         1       1  female  19.0      0      0  30.0000        S

[233 rows x 8 columns]

In [64]:
data.query("Survived == 1 & Sex == 'female' & Embarked == 'C'")

     Survived  Pclass     Sex   Age  SibSp  Parch      Fare Embarked
1           1       1  female  38.0      1      0   71.2833        C
9           1       2  female  14.0      1      0   30.0708        C
19          1       3  female   NaN      0      0    7.2250        C
31          1       1  female   NaN      1      0  146.5208        C
39          1       3  female  14.0      1      0   11.2417        C
..        ...     ...     ...   ...    ...    ...       ...      ...
858         1       3  female  24.0      0      3   19.2583        C
866         1       2  female  27.0      1      0   13.8583        C
874         1       2  female  28.0      1      0   24.0000        C
875         1       3  female  15.0      0      0    7.2250        C
879         1       1  female  56.0      0      1   83.1583        C

[64 rows x 8 columns]

In [66]:
data.query("Sex == 'male' & Embarked == 'S' & Pclass == 3")

     Survived  Pclass   Sex   Age  SibSp  Parch     Fare Embarked
0           0       3  male  22.0      1      0   7.2500        S
4           0       3  male  35.0      0      0   8.0500        S
7           0       3  male   2.0      3      1  21.0750        S
12          0       3  male  20.0      0      0   8.0500        S
13          0       3  male  39.0      1      5  31.2750        S
..        ...     ...   ...   ...    ...    ...      ...      ...
876         0       3  male  20.0      0      0   9.8458        S
877         0       3  male  19.0      0      0   7.8958        S
878         0       3  male   NaN      0      0   7.8958        S
881         0       3  male  33.0      0      0   7.8958        S
884         0       3  male  25.0      0      0   7.0500        S

[265 rows x 8 columns]

In [68]:
Sex_male_01 = data.query("Sex == 'male'")
Sex_male_01

     Survived  Pclass   Sex   Age  SibSp  Parch     Fare Embarked
0           0       3  male  22.0      1      0   7.2500        S
4           0       3  male  35.0      0      0   8.0500        S
5           0       3  male   NaN      0      0   8.4583        Q
6           0       1  male  54.0      0      0  51.8625        S
7           0       3  male   2.0      3      1  21.0750        S
..        ...     ...   ...   ...    ...    ...      ...      ...
883         0       2  male  28.0      0      0  10.5000        S
884         0       3  male  25.0      0      0   7.0500        S
886         0       2  male  27.0      0      0  13.0000        S
889         1       1  male  26.0      0      0  30.0000        C
890         0       3  male  32.0      0      0   7.7500        Q

[577 rows x 8 columns]

In [70]:
Sex_Female = data.query("Sex != 'male'")
Sex_Female

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
1           1       1  female  38.0      1      0  71.2833        C
2           1       3  female  26.0      0      0   7.9250        S
3           1       1  female  35.0      1      0  53.1000        S
8           1       3  female  27.0      0      2  11.1333        S
9           1       2  female  14.0      1      0  30.0708        C
..        ...     ...     ...   ...    ...    ...      ...      ...
880         1       2  female  25.0      0      1  26.0000        S
882         0       3  female  22.0      0      0  10.5167        S
885         0       3  female  39.0      0      5  29.1250        Q
887         1       1  female  19.0      0      0  30.0000        S
888         0       3  female   NaN      1      2  23.4500        S

[314 rows x 8 columns]

In [72]:
Fare_under10 = data.query("Fare < 10 & Age >= 10")
Fare_under10

     Survived  Pclass     Sex   Age  SibSp  Parch    Fare Embarked
0           0       3    male  22.0      1      0  7.2500        S
2           1       3  female  26.0      0      0  7.9250        S
4           0       3    male  35.0      0      0  8.0500        S
12          0       3    male  20.0      0      0  8.0500        S
14          0       3  female  14.0      0      0  7.8542        S
..        ...     ...     ...   ...    ...    ...     ...      ...
876         0       3    male  20.0      0      0  9.8458        S
877         0       3    male  19.0      0      0  7.8958        S
881         0       3    male  33.0      0      0  7.8958        S
884         0       3    male  25.0      0      0  7.0500        S
890         0       3    male  32.0      0      0  7.7500        Q

[235 rows x 8 columns]

In [74]:
Sex_Age_20 = data.query("Sex == 'male' & Age == 22.0")

In [76]:
Sex_Age_20

     Survived  Pclass   Sex   Age  SibSp  Parch      Fare Embarked
0           0       3  male  22.0      1      0    7.2500        S
60          0       3  male  22.0      0      0    7.2292        C
80          0       3  male  22.0      0      0    9.0000        S
112         0       3  male  22.0      0      0    8.0500        S
212         0       3  male  22.0      0      0    7.2500        S
225         0       3  male  22.0      0      0    9.3500        S
243         0       3  male  22.0      0      0    7.1250        S
287         0       3  male  22.0      0      0    7.8958        S
320         0       3  male  22.0      0      0    7.2500        S
373         0       1  male  22.0      0      0  135.6333        C
395         0       3  male  22.0      0      0    7.7958        S
478         0       3  male  22.0      0      0    7.5208        S
521         0       3  male  22.0      0      0    7.8958        S
553         1       3  male  22.0      0      0    7.2250        C
588         0       3  male  22.0      0      0    8.0500        S

In [78]:
data.query("Sex == 'male' & Age == 90")

Empty DataFrame
Columns: [Survived, Pclass, Sex, Age, SibSp, Parch, Fare, Embarked]
Index: []

### Pivot()

In [81]:
data.pivot_table(values= 'Fare', index= 'Sex', columns= 'Pclass', aggfunc= 'sum')

Pclass          1          2          3
Sex
female  9975.8250  1669.7292  2321.1086
male    8201.5875  2132.1125  4393.5865

In [83]:
data.pivot_table(values= 'Fare', index= 'Pclass', columns= 'Sex', aggfunc= 'mean')

Sex         female       male
Pclass
1       106.125798  67.226127
2        21.970121  19.741782
3        16.118810  12.661633

In [85]:
data.pivot_table(values= 'Fare', index= 'Pclass', columns= 'Sex', aggfunc= 'mean', margins= True)

Sex         female       male        All
Pclass
1       106.125798  67.226127  84.154687
2        21.970121  19.741782  20.662183
3        16.118810  12.661633  13.675550
All      44.479818  25.523893  32.204208

In [87]:
data

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0           0       3    male  22.0      1      0   7.2500        S
1           1       1  female  38.0      1      0  71.2833        C
2           1       3  female  26.0      0      0   7.9250        S
3           1       1  female  35.0      1      0  53.1000        S
4           0       3    male  35.0      0      0   8.0500        S
..        ...     ...     ...   ...    ...    ...      ...      ...
886         0       2    male  27.0      0      0  13.0000        S
887         1       1  female  19.0      0      0  30.0000        S
888         0       3  female   NaN      1      2  23.4500        S
889         1       1    male  26.0      0      0  30.0000        C
890         0       3    male  32.0      0      0   7.7500        Q

[891 rows x 8 columns]

In [89]:
data.pivot_table(values= 'Age', index= 'Embarked', columns= 'Sex', aggfunc= 'mean')

Sex          female       male
Embarked
C         28.344262  32.998841
Q         24.291667  30.937500
S         27.771505  30.291440

In [ ]:
pivot_02 = data.pivot_table(values='Fare', index='Embarked', columns='Pclass', aggfunc='sum')

In [ ]:
pivot_02

In [ ]:
pivot_03 = data.pivot_table(values='Fare', index='Embarked', columns='Pclass', aggfunc='mean')

In [ ]:
pivot_03

In [93]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       714 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Fare      891 non-null    float64
 7   Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(2)
memory usage: 55.8+ KB

In [95]:
data.select_dtypes(int)

     Survived  Pclass  SibSp  Parch
0           0       3      1      0
1           1       1      1      0
2           1       3      0      0
3           1       1      1      0
4           0       3      0      0
..        ...     ...    ...    ...
886         0       2      0      0
887         1       1      0      0
888         0       3      1      2
889         1       1      0      0
890         0       3      0      0

[891 rows x 4 columns]

In [97]:
data.select_dtypes(float)

      Age     Fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [ ]:
data.select_dtypes('int64')

In [ ]:
data.select_dtypes(int)

In [ ]:
data.select_dtypes(float)

In [99]:
data.select_dtypes(object)

        Sex Embarked
0      male        S
1    female        C
2    female        S
3    female        S
4      male        S
..      ...      ...
886    male        S
887  female        S
888  female        S
889    male        C
890    male        Q

[891 rows x 2 columns]

### cumsum()

In [101]:
data

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0           0       3    male  22.0      1      0   7.2500        S
1           1       1  female  38.0      1      0  71.2833        C
2           1       3  female  26.0      0      0   7.9250        S
3           1       1  female  35.0      1      0  53.1000        S
4           0       3    male  35.0      0      0   8.0500        S
..        ...     ...     ...   ...    ...    ...      ...      ...
886         0       2    male  27.0      0      0  13.0000        S
887         1       1  female  19.0      0      0  30.0000        S
888         0       3  female   NaN      1      2  23.4500        S
889         1       1    male  26.0      0      0  30.0000        C
890         0       3    male  32.0      0      0   7.7500        Q

[891 rows x 8 columns]

In [103]:
data.columns

Index(['Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare',
       'Embarked'],
      dtype='object')

In [105]:
data[['Embarked', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Survived']]

    Embarked  Pclass     Sex   Age  SibSp  Parch  Survived
0          S       3    male  22.0      1      0         0
1          C       1  female  38.0      1      0         1
2          S       3  female  26.0      0      0         1
3          S       1  female  35.0      1      0         1
4          S       3    male  35.0      0      0         0
..       ...     ...     ...   ...    ...    ...       ...
886        S       2    male  27.0      0      0         0
887        S       1  female  19.0      0      0         1
888        S       3  female   NaN      1      2         0
889        C       1    male  26.0      0      0         1
890        Q       3    male  32.0      0      0         0

[891 rows x 7 columns]

In [107]:
data[['Fare', 'Age']]

        Fare   Age
0     7.2500  22.0
1    71.2833  38.0
2     7.9250  26.0
3    53.1000  35.0
4     8.0500  35.0
..       ...   ...
886  13.0000  27.0
887  30.0000  19.0
888  23.4500   NaN
889  30.0000  26.0
890   7.7500  32.0

[891 rows x 2 columns]

In [109]:
data[['Fare', 'Age']].cumsum()

           Fare       Age
0        7.2500     22.00
1       78.5333     60.00
2       86.4583     86.00
3      139.5583    121.00
4      147.6083    156.00
..          ...       ...
886  28602.7493  21128.17
887  28632.7493  21147.17
888  28656.1993       NaN
889  28686.1993  21173.17
890  28693.9493  21205.17

[891 rows x 2 columns]

### replace

In [111]:
data

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0           0       3    male  22.0      1      0   7.2500        S
1           1       1  female  38.0      1      0  71.2833        C
2           1       3  female  26.0      0      0   7.9250        S
3           1       1  female  35.0      1      0  53.1000        S
4           0       3    male  35.0      0      0   8.0500        S
..        ...     ...     ...   ...    ...    ...      ...      ...
886         0       2    male  27.0      0      0  13.0000        S
887         1       1  female  19.0      0      0  30.0000        S
888         0       3  female   NaN      1      2  23.4500        S
889         1       1    male  26.0      0      0  30.0000        C
890         0       3    male  32.0      0      0   7.7500        Q

[891 rows x 8 columns]

In [113]:
data.Sex.replace({'male':0, 'female':1}, inplace=True)

In [115]:
data

     Survived  Pclass  Sex   Age  SibSp  Parch     Fare Embarked
0           0       3    0  22.0      1      0   7.2500        S
1           1       1    1  38.0      1      0  71.2833        C
2           1       3    1  26.0      0      0   7.9250        S
3           1       1    1  35.0      1      0  53.1000        S
4           0       3    0  35.0      0      0   8.0500        S
..        ...     ...  ...   ...    ...    ...      ...      ...
886         0       2    0  27.0      0      0  13.0000        S
887         1       1    1  19.0      0      0  30.0000        S
888         0       3    1   NaN      1      2  23.4500        S
889         1       1    0  26.0      0      0  30.0000        C
890         0       3    0  32.0      0      0   7.7500        Q

[891 rows x 8 columns]

In [117]:
data.Sex.replace({0:'male', 1:'female'}, inplace=True)
data

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0           0       3    male  22.0      1      0   7.2500        S
1           1       1  female  38.0      1      0  71.2833        C
2           1       3  female  26.0      0      0   7.9250        S
3           1       1  female  35.0      1      0  53.1000        S
4           0       3    male  35.0      0      0   8.0500        S
..        ...     ...     ...   ...    ...    ...      ...      ...
886         0       2    male  27.0      0      0  13.0000        S
887         1       1  female  19.0      0      0  30.0000        S
888         0       3  female   NaN      1      2  23.4500        S
889         1       1    male  26.0      0      0  30.0000        C
890         0       3    male  32.0      0      0   7.7500        Q

[891 rows x 8 columns]

In [119]:
data.Pclass.replace({3:'Third', 2:'Second', 1:'First'}, inplace=True)
data

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0           0   Third    male  22.0      1      0   7.2500        S
1           1   First  female  38.0      1      0  71.2833        C
2           1   Third  female  26.0      0      0   7.9250        S
3           1   First  female  35.0      1      0  53.1000        S
4           0   Third    male  35.0      0      0   8.0500        S
..        ...     ...     ...   ...    ...    ...      ...      ...
886         0  Second    male  27.0      0      0  13.0000        S
887         1   First  female  19.0      0      0  30.0000        S
888         0   Third  female   NaN      1      2  23.4500        S
889         1   First    male  26.0      0      0  30.0000        C
890         0   Third    male  32.0      0      0   7.7500        Q

[891 rows x 8 columns]

In [121]:
data.Survived.replace({0:'Dead', 1:'Survived'}, inplace=True)
data.head(10)

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0      Dead   Third    male  22.0      1      0   7.2500        S
1  Survived   First  female  38.0      1      0  71.2833        C
2  Survived   Third  female  26.0      0      0   7.9250        S
3  Survived   First  female  35.0      1      0  53.1000        S
4      Dead   Third    male  35.0      0      0   8.0500        S
5      Dead   Third    male   NaN      0      0   8.4583        Q
6      Dead   First    male  54.0      0      0  51.8625        S
7      Dead   Third    male   2.0      3      1  21.0750        S
8  Survived   Third  female  27.0      0      2  11.1333        S
9  Survived  Second  female  14.0      1      0  30.0708        C

In [123]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    object
 1   Pclass    891 non-null    object
 2   Sex       891 non-null    object
 3   Age       714 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Fare      891 non-null    float64
 7   Embarked  889 non-null    object
dtypes: float64(2), int64(2), object(4)
memory usage: 55.8+ KB

### rename

In [125]:
data.rename(columns={'Sex':'SEX', 'SibSp':'SP'}, inplace=True)

In [127]:
data

     Survived  Pclass     SEX   Age  SP  Parch     Fare Embarked
0        Dead   Third    male  22.0   1      0   7.2500        S
1    Survived   First  female  38.0   1      0  71.2833        C
2    Survived   Third  female  26.0   0      0   7.9250        S
3    Survived   First  female  35.0   1      0  53.1000        S
4        Dead   Third    male  35.0   0      0   8.0500        S
..        ...     ...     ...   ...  ..    ...      ...      ...
886      Dead  Second    male  27.0   0      0  13.0000        S
887  Survived   First  female  19.0   0      0  30.0000        S
888      Dead   Third  female   NaN   1      2  23.4500        S
889  Survived   First    male  26.0   0      0  30.0000        C
890      Dead   Third    male  32.0   0      0   7.7500        Q

[891 rows x 8 columns]

In [129]:
data.rename(columns={'Fare':'Charge'}, inplace=True)
data.head(10)

   Survived  Pclass     SEX   Age  SP  Parch   Charge Embarked
0      Dead   Third    male  22.0   1      0   7.2500        S
1  Survived   First  female  38.0   1      0  71.2833        C
2  Survived   Third  female  26.0   0      0   7.9250        S
3  Survived   First  female  35.0   1      0  53.1000        S
4      Dead   Third    male  35.0   0      0   8.0500        S
5      Dead   Third    male   NaN   0      0   8.4583        Q
6      Dead   First    male  54.0   0      0  51.8625        S
7      Dead   Third    male   2.0   3      1  21.0750        S
8  Survived   Third  female  27.0   0      2  11.1333        S
9  Survived  Second  female  14.0   1      0  30.0708        C

### fillna

In [131]:
data.isnull().sum()

Survived      0
Pclass        0
SEX           0
Age         177
SP            0
Parch         0
Charge        0
Embarked      2
dtype: int64

In [133]:
data.Age.mean()

29.69911764705882

In [135]:
data.Age.fillna(30, inplace=True)

In [137]:
data.isnull().sum()

Survived    0
Pclass      0
SEX         0
Age         0
SP          0
Parch       0
Charge      0
Embarked    2
dtype: int64

In [139]:
data.Embarked.value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [141]:
data.Embarked.fillna('S', inplace=True)

In [143]:
data.isnull().sum()

Survived    0
Pclass      0
SEX         0
Age         0
SP          0
Parch       0
Charge      0
Embarked    0
dtype: int64

### pct_change

In [4]:
data

NameError: name 'data' is not defined

In [ ]:
data.Fare.pct_change()

### pd.cut

In [ ]:
data

In [145]:
cutoff = [0, 18, 50, 85]
labels = ['Child', 'Adult', 'Old']
data['AGE_TYPE'] = pd.cut(data.Age, bins=cutoff, labels=labels)

In [149]:
data.sample(20)

     Survived  Pclass     SEX   Age  SP  Parch    Charge Embarked AGE_TYPE
160      Dead   Third    male  44.0   0      1   16.1000        S    Adult
874  Survived  Second  female  28.0   1      0   24.0000        C    Adult
574      Dead   Third    male  16.0   0      0    8.0500        S    Child
446  Survived  Second  female  13.0   0      1   19.5000        S    Child
530  Survived  Second  female   2.0   1      1   26.0000        S    Child
315  Survived   Third  female  26.0   0      0    7.8542        S    Adult
400  Survived   Third    male  39.0   0      0    7.9250        S    Adult
630  Survived   First    male  80.0   0      0   30.0000        S      Old
553  Survived   Third    male  22.0   0      0    7.2250        C    Adult
311  Survived   First  female  18.0   2      2  262.3750        C    Child
663      Dead   Third    male  36.0   0      0    7.4958        S    Adult
482      Dead   Third    male  50.0   0      0    8.0500        S    Adult
802  Survived   First    male  11.0   1      2  120.0000        S    Child
222      Dead   Third    male  51.0   0      0    8.0500        S      Old
355      Dead   Third    male  28.0   0      0    9.5000        S    Adult
264      Dead   Third  female  30.0   0      0    7.7500        Q    Adult
556  Survived   First  female  48.0   1      0   39.6000        C    Adult
150      Dead  Second    male  51.0   0      0   12.5250        S      Old
411      Dead   Third    male  30.0   0      0    6.8583        Q    Adult
63       Dead   Third    male   4.0   3      2   27.9000        S    Child

In [ ]:
data.groupby(['AGE_TYPE'])['Survived'].sum().reset_index()

### n_largets and n-smallest

In [151]:
data.nlargest(5, 'Age')

     Survived Pclass   SEX   Age  SP  Parch   Charge Embarked AGE_TYPE
630  Survived  First  male  80.0   0      0  30.0000        S      Old
851      Dead  Third  male  74.0   0      0   7.7750        S      Old
96       Dead  First  male  71.0   0      0  34.6542        C      Old
493      Dead  First  male  71.0   0      0  49.5042        C      Old
116      Dead  Third  male  70.5   0      0   7.7500        Q      Old

In [153]:
data.nsmallest(3, 'Age')

     Survived  Pclass     SEX   Age  SP  Parch   Charge Embarked AGE_TYPE
803  Survived   Third    male  0.42   0      1   8.5167        C    Child
755  Survived  Second    male  0.67   1      1  14.5000        S    Child
469  Survived   Third  female  0.75   2      1  19.2583        C    Child

### CROSS TABULATION
* In statistics, a contingency table (also known as a cross tabulation or crosstab) is a type of table in a matrix format that displays the (multivariate) frequency distribution of the variables. They are heavily used in survey research, business intelligence, engineering, and scientific research. They provide a basic picture of the interrelation between two variables and can help find interactions between them. The term contingency table was first used by Karl Pearson in "On the Theory of Contingency and Its Relation to Association and Normal Correlation",[1] part of the Drapers' Company Research Memoirs Biometric Series I published in 1904.

In [157]:
pd.crosstab(data.Pclass, data.Embarked)

Embarked   C   Q    S
Pclass
First     85   2  129
Second    17   3  164
Third     66  72  353

In [159]:
pd.crosstab(data.SEX, data.Embarked)

Embarked   C   Q    S
SEX
female    73  36  205
male      95  41  441

In [161]:
pd.crosstab(data.Pclass, data.Embarked, margins=True)

Embarked    C   Q    S  All
Pclass
First      85   2  129  216
Second     17   3  164  184
Third      66  72  353  491
All       168  77  646  891

In [163]:
data_cars = pd.read_csv('./Car_sales.csv')
data_cars

,Manufacturer,Model,Sales_in_thousands,__year_resale_value,Vehicle_type,Price_in_thousands,Engine_size,Horsepower,Wheelbase,Width,Length,Curb_weight,Fuel_capacity,Fuel_efficiency,Latest_Launch,Power_perf_factor
0,Acura,Integra,16.919,16.360,Passenger,21.50,1.8,140.0,101.2,67.3,172.4,2.639,13.2,28.0,2/2/2012,58.280150
1,Acura,TL,39.384,19.875,Passenger,28.40,3.2,225.0,108.1,70.3,192.9,3.517,17.2,25.0,6/3/2011,91.370778
2,Acura,CL,14.114,18.225,Passenger,NaN,3.2,225.0,106.9,70.6,192.0,3.470,17.2,26.0,1/4/2012,NaN
3,Acura,RL,8.588,29.725,Passenger,42.00,3.5,210.0,114.6,71.4,196.6,3.850,18.0,22.0,3/10/2011,91.389779
4,Audi,A4,20.397,22.255,Passenger,23.99,1.8,150.0,102.6,68.2,178.0,2.998,16.4,27.0,10/8/2011,62.777639
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
152,Volvo,V40,3.545,NaN,Passenger,24.40,1.9,160.0,100.5,67.6,176.6,3.042,15.8,25.0,9/21/2011,66.498812
153,Volvo,S70,15.245,NaN,Passenger,27.50,2.4,168.0,104.9,69.3,185.9,3.208,17.9,25.0,11/24/2012,70.654495
154,Volvo,V70,17.531,NaN,Passenger,28.80,2.4,168.0,104.9,69.3,186.2,3.259,17.9,25.0,6/25/2011,71.155978
155,Volvo,C70,3.493,NaN,Passenger,45.50,2.3,236.0,104.9,71.5,185.7,3.601,18.5,23.0,4/26/2011,101.623357
156,Volvo,S80,18.969,NaN,Passenger,36.00,2.9,201.0,109.9,72.1,189.8,3.600,21.1,24.0,11/14/2011,85.735655